{
"name": "Overview",
"descrição": "O projeto Hybroo foi criado por Edgar Marcos Ancioto Junior, em sua dissertação de mestrado em maio de 2018. A plataforma tem como objetivo reunir conjuntos de problemas de diferentes tipos e possibilitar a resolução dos mesmos com o uso de algoritmos de Inteligência Artificial.\nO repositório conta com problemas de funções não lineares multidimensionais, problema do caixeiro viajante e roteamento de veículos capacitado. Os métodos de resolução possuem metaheurísticas como: Algoritmo Genético, Recozimento Simulado e Otimização por Colônia de Formigas, com a possibilidade da utilização híbrida colaborativa.\nObs.: Atualmente a plataforma está passando por adequações que visam escalabilidade e preparação para resolver problemas reais, com não linearidades e alta dimensões. \nO desenvolvimento da plataforma contou com a produção de 2 egressos do mestrado e 10 alunos de iniciação científica, entre 2018 e 2020. O desenvolvimento da Hybroo gerou grande impacto na formação de novos pesquisadores, possuindo atualmente 4 trabalhos de iniciação científica em andamento, entre o período de agosto de 2020 a setembro de 2021, além de 7 novas submissões em 2021.\nCom base nos planos de iniciação científica 5 trabalhos de conclusão de curso foram desenvolvidos em 2020, com destaque para 3 aprovações no mestrado na Unicamp em 2020. Em 2018, um dos alunos de iniciação científica foi premiado por trabalho relacionado à plataforma.\nForam desenvolvidos planos de trabalho envolvendo pesquisas com otimização de portifólio e predição de preços, retorno e volatilidade de ativos da bolsa de valores brasileira, com perspectiva em inovação em finanças, para gerar automáticas de investimentos (1 dissertação, 02 alunos de IC), usando algoritmo colônia de abelhas e redes neurais LSTM e algoritmos determinísticos.\nForam desenvolvidos esforços para operacionalizar na plataforma de recursos de calibração online de parâmetros de metaheurísticas, análise estatística com testes não paramétricos para comparação de algoritmos e híbridos colaborativos e integrativos entre algoritmos de Swarm Intelligence e híbridos integrativos com base no algoritmo genético. A plataforma é uma produção técnica com possibilidade real de ter registro de software, no futuro, aumento a visibilidade do programa e contribuindo com uma área de pesquisa, uma vez que tem um ambiente experimental para testes de algoritmos e com possibilidade de resolver problemas reais.",
"description": "The Hybroo project was created by Edgar Marcos Ancioto Junior, in his master's dissertation in May 2018. The platform aims to bring together sets of problems of different types and enable them to be solved using Artificial Intelligence algorithms.\nThe repository has problems with multidimensional non-linear functions, traveling salesman problem and enabled vehicle routing. The resolution methods have metaheuristics such as: Genetic Algorithm, Simulated Annealing and Ant Colony Optimization, with the possibility of collaborative hybrid use.\nNote: Currently, the platform is undergoing adjustments aimed at scalability and preparation to solve real problems, with non-linearities and high dimensions.\nThe development of the platform counted on the production of 2 graduates of the master's degree and 10 students of scientific initiation, between 2018 and 2020. The development of Hybroo generated a great impact in the training of new researchers, currently having 4 scientific initiation works in progress, between the August 2020 to September 2021, in addition to 7 new submissions in 2021.\nBased on the scientific initiation plans, 5 course completion works were developed in 2020, with emphasis on 3 master's approvals at Unicamp in 2020. In 2018, one of the scientific initiation students was awarded for work related to the platform.\nWork plans were developed involving research with portfolio optimization and price prediction, return and volatility of assets on the Brazilian stock exchange, with a view to innovation in finance, to generate investment automatic (1 dissertation, 02 CI students), using colony bee algorithm and LSTM neural networks and deterministic algorithms.\nEfforts were made to operationalize the metaheuristic parameters online calibration resource platform, statistical analysis with non-parametric tests to compare collaborative and integrative algorithms and hybrids between Swarm Intelligence algorithms and integrative hybrids based on the genetic algorithm. The platform is a technical production with a real possibility of having software registration, in the future, increasing the visibility of the program and contributing to a research area, since it has an experimental environment for testing algorithms and with the possibility of solving real problems."
"productions":[
{ "type": "periodic", "name": "Artigo em periódico", "title": "PEREIRA, L. L. M.; SANTOS, D. C.; MORAES, M. H. M.; GONÇALVES FILHO, G. M.; ANCIOTO JUNIOR, E. M.; PEREIRA JUNIOR, W. M.; DANTAS, M. J. P.. Estudo de Sensibilidade do Algoritmo de Colônia de Vagalumes para um Problema de Engenharia Envolvendo Dimensionamento de Treliças. TENDÊNCIAS EM MATEMÁTICA APLICADA E COMPUTACIONAL, v. 21, p. 583-599, 2020. Disponível em: https://www.researchgate.net/publication/346941688_Estudo_de_Sensibilidade_do_Algoritmo_de_Colonia_de_Vagalumes_para_um_Problema_de_Engenharia_Envolvendo_Dimensionamento_de_Trelicas Acesso em: 10 abr. 2021."},
{ "type": "complete", "name": "Artigos completos", "title": "MILHOMEM, D. A.; PEREIRA DANTAS, MARIA JOSÉ. AVALIAÇÃO DE TENDÊNCIAS NA OTIMIZAÇÃO DE PORTFÓLIO: UMA REVISÃO SISTEMÁTICA DA LITERATURA. In: Inovação e Sustentabilidade na gestão de processos de negócios, 2018, Bauru-São Paulo. Anais do XXV simpósio de Engenharia de Produção - SIMPEP, 2018."},
{ "type": "complete", "name": "Artigos completos", "title": "PEREIRA JUNIOR, W. M.; SARMENTO, A. P.; DANTAS, M. J. P. ; DANTAS, C. P. ; PITUBA, J. J. C. . AVALIAÇÃO DOS PARÂMETROS DO ALGORITMO DE COLÔNIA DE VAGALUMES (ACV) PARA UMA FUNÇÃO DE BENCHMARK. In: II ENPEEX UFG, 2018, Catalão Goiás. Anais do II ENPEEX, 2018. p. 1-7."},
{ "type": "complete", "name": "Artigos completos", "title": "MILHOMEM, D. A.; DANTAS, M. J. P. MODELO HÍBRIDO DE MÉDIA VARIÂNCIA E SUAVIZAÇÃO EXPONENCIAL DE HOLT-WINTERS PARA OTIMIZAÇÃO DE PORTFÓLIO. In: XXVI Simpósio de Engenharia de Produção, 2019, Bauru - SP. DESAFIOS DA ENGENHARIA DE PRODUÇÃO NO CONTEXTO DA INDÚSTRIA 4.0, 2019."},
{ "type": "complete", "name": "Artigos completos", "title": "ANCIOTO JUNIOR, E. M.; ALEIXO, N. C. ; SANTOS, R. S. ; DANTAS, M. J. P. . O PROBLEMA DO CAIXEIRO VIAJANTE APLICADO À ROTEIRIZAÇÃO DA MANUTENÇÃO PREDIAL DO PODER JUDICIÁRIO DO ESTADO DE GOIÁS. In: Inovação e sustentabilidade na gestão de processos de negócios, 2018, Bauru_São Paulo. 2018. p. 1-10. Disponível em <http://www.simpep.feb.unesp.br/abrir_arquivo_pdf.php?tipo=artigo&evento=13&art=891&cad=28869&opcao=com_id>, Acesso em 10 abr. 2021."},
{ "type": "complete", "name": "Artigos completos", "title": "Bruno Almêda de Oliveira; Edgar Ancioto; Danilo Alcântara Milhomem; Maria José Pereira Dantas et al. ALGORITMOS DE INTELIGÊNCIA COLETIVA PARA O PROBLEMA DE ROTEAMENTO DE VEÍCULOS: REVISÃO. In: ANAIS DO LII SIMPóSIO BRASILEIRO DE PESQUISA OPERACIONAL, 2020, João Pessoa. Anais eletrônicos... Campinas, Galoá, 2020. Disponível em: <https://proceedings.science/sbpo-2020/papers/algoritmos-de-inteligencia-coletiva-para-o-problema-de-roteamento-de-veiculos--revisao> Acesso em: 10 abr. 2021."},
{ "type": "complete", "name": "Artigos completos", "title": "MATA, J. R.; MILHOMEM, DANILO ALCANTARA ; DANTAS, M. J. P. . OTIMIZAÇÃO DE CARTEIRA DE AÇÕES POR MEIO DE ALGORITMOS HÍBRIDOS ESTOCÁSTICO E EXATO. In: XXVII SIMPEP 2020, 2020. ANAIS DO XXVII SIMPEP, 2020. Disponível em < file:///C:/Users/Maria%20Jos%C3%A9/Downloads/XXVII_SIMPEP_Art_1030%20(1).pdf> Acesso em 10 abr. 2021."},
{ "type": "resume", "name": "Resumos", "title": "MIRANDA, A. S. ; SILVA, R. H. R. ; SANTOS, D. C. ; PEREIRA, L. L. M. ; ANCIOTO JUNIOR, E. M. ; PEREIRA JUNIOR, W. M. ; DANTAS, M. J. P. . Protótipo em Python para otimização irrestrita de funções não-lineares com métodos determinísticos e Meta-heurísticas. In: Cnmac 2019, 2020, Uberlândia. XXXIX Congresso nacional de matemática aplicada e computacional, 2020. v. 7. p. 010262-1-010262-2. Disponível em <https://proceedings.sbmac.org.br/sbmac/article/view/2873/2903> Acesso em 10 abr. 2021."},
{ "type": "resume", "name": "Resumos", "title": "Ítalo Fernandes; Danilo Alcântara Milhomem; Edgar Ancioto; Maria José Pereira Dantas et al. CONTROLE ONLINE DE PARÂMETROS EM METAHEURÍSTICAS: UMA REVISÃO SOBRE AS TENDÊNCIAS E OPORTUNIDADES NESTE CAMPO. In: ANAIS DO LII SIMPóSIO BRASILEIRO DE PESQUISA OPERACIONAL, 2020, João Pessoa. Anais eletrônicos... Campinas, Galoá, 2020. Disponível em: <https://proceedings.science/sbpo-2020/papers/controle-online-de-parametros-em-metaheuristicas--uma-revisao-sobre-as-tendencias-e-oportunidades-neste-campo> Acesso em: 10 abr. 2021."},
{ "type": "resume", "name": "Resumos", "title": "ANCIOTO JUNIOR, E. M.; Dantas, Maria José Pereira; PEREIRA JUNIOR, W. M.. PLATAFORMA ONLINE PARA CRIAÇÃO DE AMBIENTE EXPERIMENTAL DE OTIMIZAÇÃO COM FOCO EM ALGORITMOS HÍBRIDOS. In: IV CONGRESSO DE CIÊNCIA E TECNOLOGIA DA PUC GOIÁS, 2018, Goiânia. ANAIS DO IV CONGRESSO DE CIÊNCIA E TECNOLOGIA DA PUC GOIÁS, 2018. p. 355-355."}
]
"team":[
{ "name": "Edgar Marcos Ancioto Junior","image":"edgar.jpg", "description": "Criação da Hybroo, de 5 dos algoritmos, coorientação dos alunos de iniciação científica para desenvolvimento dos planos de trabalho." ,"lattes": "http://lattes.cnpq.br/7117015785768463", "linkedin": "https://www.linkedin.com/in/edgar-ancioto-837983191/", "github":"https://github.com/edgarancioto"},
{ "name": "Edgar Marcos Ancioto Junior","image":"edgar.jpg", "description": "Criação da Hybroo, de 5 dos algoritmos, coorientação dos alunos de iniciação científica para desenvolvimento dos planos de trabalho." ,"lattes": "http://lattes.cnpq.br/7117015785768463", "linkedin": "https://www.linkedin.com/in/edgar-ancioto-837983191/", "github":"https://github.com/edgarancioto"},
]
}